Австралия/src/Catalogs/TaxReports/TaxReports.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>TaxReports</name>
  <attributes>
    <name>BeginOfPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndOfPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxReportTemplate</name>
    <type>
      <types>CatalogRef.TaxReportTemplates</types>
    </type>
  </attributes>
  <attributes>
    <name>ReportStatus</name>
    <type>
      <types>EnumRef.TaxReportStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxReportStorage</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>IsFilled</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/TaxReports/Forms/ListForm/Module.bsl
#Region FormCommandsEventHandlers

&AtClient
Procedure OpenReport(Command)
	
	If Items.List.CurrentData = Undefined Then
		Return;
	Else
		RefCurrentData = Items.List.CurrentData.Ref;
	EndIf;
	
	ParametersOfDataProcessor = GetParametersOfDataProcessor(RefCurrentData);

	ParametersOfDataProcessor.Insert("ReferenceTaxReport", ParametersOfDataProcessor.Ref); 
	
	Cancel = False;
	
	NameDataProcessor = ConnectExternalDataProcessor(ParametersOfDataProcessor, Cancel);
	
	If Cancel Then
		Return;
	EndIf;
	
	//GetNameDataProcessor(RefCurrentData);
	
	OpenForm("ExternalDataProcessor." + NameDataProcessor + ".Form",
		ParametersOfDataProcessor,
		ThisObject,
		,,,,
		FormWindowOpeningMode.Independent);
		
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure FilterCompanyOnChange(Item)
	
	DriveClientServer.SetListFilterItem(List, "Company", FilterCompany, ValueIsFilled(FilterCompany));
	
EndProcedure


&AtClient
Procedure FilterStatusOnChange(Item)
	
	DriveClientServer.SetListFilterItem(List, "ReportStatus", FilterStatus, ValueIsFilled(FilterStatus));
	
EndProcedure


&AtClient
Procedure FilterTaxReportTemplateOnChange(Item)
	
	DriveClientServer.SetListFilterItem(
		List, 
		"TaxReportTemplate", 
		FilterTaxReportTemplate, 
		ValueIsFilled(FilterTaxReportTemplate));
	
EndProcedure
	
	
&AtClient
Procedure FilterPeriodOnChange(Item)
	
	DriveClientServer.SetListFilterItem(
		List,
		"BeginOfPeriod",
		FilterPeriod.StartDate,
		ValueIsFilled(FilterPeriod.StartDate),
		DataCompositionComparisonType.GreaterOrEqual);
		
	DriveClientServer.SetListFilterItem(
		List,
		"EndOfPeriod",
		FilterPeriod.EndDate,
		ValueIsFilled(FilterPeriod.EndDate),
		DataCompositionComparisonType.LessOrEqual);	
	
EndProcedure

#EndRegion

#Region Private

&AtServerNoContext
Function ConnectExternalDataProcessor(ParametersOfDataProcessor, Cancel)
	
	NameDataProcessor = Catalogs.TaxReports.GetExternalDataProcessor(ParametersOfDataProcessor, Cancel);
	
	Return NameDataProcessor;
	
EndFunction

&AtServerNoContext
Function GetParametersOfDataProcessor(RefCurrentData)
	
	Return Common.ObjectAttributesValues(RefCurrentData,
		"Company, BeginOfPeriod, EndOfPeriod, IsFilled, Ref, ReportStatus");
	
EndFunction

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If EventName = "RefreshTaxReportList" Then
		Items.List.Refresh();
	EndIf;
	
EndProcedure

#EndRegion
